/procディレクトリ配下	説明
interrupts	IRQに関する情報
ioports	I/Oアドレスの情報
bus/pci/devices	PCIデバイスに関する情報
bus/usb/devices	USBデバイスに関する情報
meminfo	メモリに関する情報
cpuinfo	CPUに関する情報
dma	使用中のDMAチャネルに関する情報
modules	ロードされているカーネルモジュールに関する情報
scsi/scsi	SCSIデバイスに関する情報
	
systemctl サブコマンド[UNIT名]	sdddd
サブコマンドの一覧	
サブコマンド	用途
disable	サービスの自動起動を無効にする
enable	サービスの自動起動を有効にする
get-default	次回起動時のターゲットを表示する
halt	システムを停止しhalt状態にする
is-active	サービスが稼働しているかを表示する
ｌist-unit-files	すべてのUnit定義ファイルを一覧表示する
reboot	システムを再起動する
reload	サービスの設定ファイルを再読み込みする
restart	サービスを再起動する
set-default  	次回起動時のターゲットを設定する
start	サービスを起動する
status	サービスの状態を表示する
stop	サービスを停止する
poweroff	システムを停止し電源を切断する
	
拡張子	機能
device	各種デバイスを管理するUnit
mount	ファイルシステムのマウントを管理するUnit
service	サービスを制御するUnit
swap	スワップ領域を管理するUnit
target	複数のサービスを一つのグループにするためのUnit
	
	
SysVinit	
システム起動時やランレベルの変更時にinitが「/etc/inittab」を参照し、ランレベルに	
応じたスクリプトは「/etc/rc[0-6].d」に入っている。	
例K01smartf	
1文字目：S(Start: サービスを起動）、K(Kill: サービスを停止)	
数字：実行優先順位。若番のものが先に実行される	
サービス名：任意の名前を付ける	
	
ランレベル	ターゲット
0	poweroff.target(システム停止)
1/s/S	rescue.target(シングルユーザモード)
2	Multi-user.target（テキストログイン、NFSなし）
3	Multi-user.target（テキストログイン）
4	Multi-user.target（未使用）
5	graphical.target（マルチユーザモード、GNUユーザモード）
6	reboot.target（システム再起動）
	
cat proc/bus/pci/devces	PCIデバイスに関する情報を表示する
lspct	
	
shutodown[オプション] 時間 [メッセージ]	
-h	システム停止
-r	システム再起動
-k	ショットダウンは行わず、ログイン中の全ユーザーに
	メッセージを送る。
-c	実行中のシャットダウンをキャンセル
時間設定	
HH:MM	HH時MM分に実行
+M	M分後に実行
now	今すぐに実行
	
USBデバイスクラス	
HID(Human Interface Device)	キーボード、マウス、ジョイスティック
Mass Storage Class	ハードディスク、USBメモリー
ACM Communication Device Class	モデム、TA
Audio Class	スピーカー、マイク等
	
Linuxカーネルの起動オプション	
init=パス	initの代わりに指定コマンドを実行
root=デバイス名	ルートパーティションを指定
数字(0-6)	指定したランレベルで起動
quiet	起動中のカーネルからの情報出力を抑制する
	
dpkgコマンド	パッケージのインストール・アンインストール等、基本的なパッケージ管理を行うコマンド
	
デイレクトリ 分割適否	用途
/home〇	一般ユーザのホームディレクトリ（書き込みが頻繁に発生）
/usr〇	起動には不要なプログラムなどを格納（読み込みが頻繁に発生)
/var〇	ログファイルやメールなど可変ファイル群を格納（書き込みが頻繁に発生）
/opt 〇	追加でインストールパッケージを格納（容量が大きくなる可能性がある）
/boot △	Linuxカーネル等起動に必須のファイルを格納
/tmp △	一時ファイルを格納
/bin ×	一般ユーザ用のコマンドを格納
/sbin ×	管理者用のコマンドを格納
/etc ×	システムの設定ファイルを格納
/lib ×	共有ライブラリを格納
/dev ×	デバイスファイルを格納
	
Zypper	openSUSEが採用しているコマンドラインのパッケージ管理ツール
apt/apt-get	Debian系パッケージを管理するdpkgツールのコマンド
yum	PRM系パッケージを管理するYUMツールのコマンド
rpm	RPM系パッケージのインストール・アンインストール等、基本的なパッケージ管理を行うコマンド
zypper[オプション]サブコマンド	
サブコマンド	説明
install in パッケージ名	パッケージのインストール
update | up　[パッケージ名]	パッケージのアップデート
remove | rm パッケージ名	パッケージのアンインストール
info パッケージ名	パッケージの詳細情報の表示
search | se キーワード	指定したキーワードでパッケージの検索
list-updates | lu [オプション]	アップデート可能なパッケージの表示
repos | lu [オプション]	アップデート可能なパッケージの表示
repos | lr	リポジトリの一覧表示
refresh	リポジトリの更新
	
yum [-y] サブコマンド	
Install | in パッケージ名	パッケージのインストール
Update | up パッケージ名	パッケージのアップデート
Remove | rm パッケージ名	パッケージのアンインストール
info パッケージ名	パッケージの詳細情報の表示
Search | se　キーワード	指定したキーワードでパッケージの検索
List-updates | lu [オプション]	アップデート可能なパッケージの表示
Repos | lr	リポジトリの一覧表示
refresh	リポジトリの更新
ldd コマンドパス	あるプログラムから必要としている共有ライブラリを表示するコマンド
	
rpmコマンド	
-i(--install)パッケージファイル名	パッケージのインストール・アンインストール等、基本的なパッケージ管理を行うコマンド
-U(--upgrade)パッケージファイル名	パッケージのアップグレード（なければインストール）
-F(--freshen)パッケージファイル名	パッケージのアップグレード（なければインストールしない）
-e(--erase)パッケージ名	パッケージのアンインストール
併用オプション	
-v	詳細情報の表示
-h(--hash)	進行状況「#」で表示
--test	実際には実行せずにテストを実施
--nodeps	依存関係を無視
	
dpkg[オプション]アクション	
オプション	説明
-E	同バージョンが既にインストールされていればインストールしない
-G	新バージョンが既にインストールされていればインストールしない
-R	ディレクトリを再帰的に処理
アクション	説明
-i(--install)パッケージファイル名	パッケージのインストール
-r(--remove)パッケージ名	設定ファイルを残したパッケージをアンインストール
-p(--purge)パッケージ名	設定ファイルも含め完全にパッケージをアンインストール
-l(--list)[検索パターン]	インストール済みパッケージを検索して表示
-L(--listfiles)パッケージ名	指定したパッケージからインストールされたファイルを一覧表示
-s(--status)パッケージ名	インストール済みパッケージの詳細情報の表示
-S(--search)検索パターン	指定したファイルがどのパッケージからインストールされたかを表示
-C(--audit)	インストールが完了していない（不完全)パッケージの表示
	https://nhentai.net/g/421047/42/
rpmコマンド	
オプション	説明
-q(--query)パッケージ名	指定したパッケージがインストールされているかを照会
-V(--verify)パッケージ名	パッケージの検査※検査方法：PRMでデータベースに格納されているファイルに関する情報と
※併用オプションは「-a(--all)と「--nomd5」のみ」	インストールされたパッケージのファイルに関する情報と比較
	※検査内容:ファイルのサイズ、MD5チェックサム、所有ユーザ、所有グループ、タイムスタンプ等
併用オプション	説明
-a(--all)	インストール済みの全パッケージの表示
-l(--list)	指定したパッケージに含まれるのファイルの表示
-i(--info)	指定したパッケージの詳細情報の表示
-f(--file)ファイル名	指定したファイルがどのパッケージからインストールされたかを表示
-p(--package)	照会対象をパッケージファイルとする
-c(--configfiles)	設定ファイルの一覧表示
--nomd5	MD5によるファイルの改ざんを検査しない
	
apt-cacheサブコマンド	
サブコマンド	説明
search キーワード	キーワードを含むパッケージを検索
show パッケージ名	指定したパッケージ情報の表示
showpkg パッケージ名	指定したパッケージの非依存関係を含めた情報の表示
depends パッケージ名	指定したパッケージが依存しているパッケージの一覧の表示
	
記号	説明
<	標準入力の入力元を指定(0<と同義)
<<(ヒアドキュメント)	標準入力の入力元を指定し、終了文字まで入力(0<<と同義)
<<<(ヒアストリング)	指定した文字列をコマンドの標準入力に送る
>	標準出力の出力先を指定(1>)と同義
>>	標準出力の出力先を指定し、出力先に追記（1>>と同義)
2>	標準エラー出力の出力先を指定
2>>	標準エラー出力の出力先を指定し、出力先に追加
＞＆2	標準出力の出力先を、標準エラー出力の出力先と同じにする。(1>＆2と同義)
2>＆1	標準エラー出力の出力先を、標準出力の出力先と同じにする
	
ps [オプション]	
オプション	説明
a	他のユーザのプロセスの表示
f	プロセスの親子関係をツリー上で表示
u	プロセスの実行ユーザ名も表示
x	制御端末の無いデーモン等のプロセスも表示
-e	すべてのプロセスの表示
-f	完全なフォーマットでプロセスを表示
-p | p PID	指定したPID(プロセスID)のプロセス情報の表示
-l | l	親プロセスのPIDや実行優先度を決定するnice値(NI)等も併せて表示
	
環境変数	説明
HISTFILE	コマンド履歴保存ファイルのパス
HISTSIZE	現在のシェルでのコマンド履歴の保存数
HISTFILESIZE	コマンド履歴保存ファイルへの履歴保存数
HOSTNAME	ホスト名
HOME	ログインしているユーザのホームディレクトリ
LANG	ロケール(言語設定)
PATH	コマンドやプログラムを検索するディレクトリのリスト
PWD	カレントディレクトリのパス
USER	ログインしているユーザ
	
tune2fs [オプション] デバイス名	
オプション	説明
-c 回数	e2fsckコマンドでファイルシステムのチェックを行うまでの最大マウント回数を指定
-i 時間[d|m|w]	e2fsckコマンドでファイルシステムのチェックを行うまでの最大時間間隔を指定
-JIS()	ext2をext3ファイルシステムに変換
-L　ラベル名	ファイルシステムのボリュームラベルを設定
	
fsck [オプション] デバイス名	
オプション	説明
-t ファイルシステムの種類	ファイルシステムの種類を指定
-A	「/etc/fstab」に記述されている全ファイルシステムに対して実行
-N	実際には実行せず、実行する内容を表示
 -a	問題を自動的に修復
 -r	問題を対話的に修復
	
df [オプション] [デバイス名又はディレクトリ名]	
オプション	説明
-h	分かりやす単位を付加して表示
-k	キロバイト単位で表示
-m	メガバイト単位で表示
-i	inodeの使用状況を表示
	
mke2fs [オプション] デバイス名	
 -j	ext3ファイルシステムを作成
 -t　ファイルシステムの種類	ファイルシステムの種類を指定（ext2/ext3/ext4）
-c	ファイルシステムを作成する前に不良ブロックを検査
	
mkfs [オプション]　デバイス名	
 -t ファイルシステムの種類	ファイルシステムの種類を指定
 -c	ファイルシステムを作成する前に不良ブロックを検査
	
ファイルシステム	説明
ext2	以前のLinuxで標準的に使用されていた規格
ext3	・ext2の後継　ジャーナリングファイルシステム
ext4	・exｔ3の後継 ジャーナリングファイルシステム
XFS	シリコングラフィック社(SGI)が開発　ジャーナリングファイルシステム　動的inode
JFS	IBMが開発 ジャーナリングファイルシステム　動的inode
	
find [検索起点ディレクトリ] [検索式] [アクション]	
-name ファイル名	ファイル名で検索
-atime 日数	最終アクセス日で検索
-mtime 日数	最終更新日で検索
-perm アクセス権	アクセス権で検索
-size サイズ	ファイルサイズで検索
-type ファイルの種類	ファイルの種類で検索
-user ユーザ名	ファイルの所有者で検索
-maxdepth 階層数	指定した階層まで検索
-mindepth 階層数	指定した階層から下を検索
アクション	説明
-print	検索結果を開業で区切って表示
-print0	検索結果をNULL文字(¥0)で区切って表示
-exec コマンド名{}￥;	検索結果のファイルに対してコマンドを実行
	
プロセス名	機能
systemd	systemdの本体となるプロセスでえ、initの代わりに常駐します
Systemd-jounald	systemdが制御する、各サービスが出力するログを扱います。
Systemd-logind	システムへのログイン、起動停止、電源ボタン操作等を管理します
Systemd-udved	従来のudevdに代わり、デバイスの動的変更、検出を行います。
	
modprobe	
設定内容	説明
options	各カーネルモジュールのデフォルトパラメータを指定する。
alias	カーネルモジュールに別名をつける
install	特定のカーネルモジュールのロード時に実行されるコマンドを指定する。
remove	特定のカーネルモジュールのアンロード時に実行されるコマンドを指定する。
blacklist	ロードしたくないカーネルモジュールを指定する。
	
コマンド	説明
wall [-n][message] ※centOS7	複数のユーザーにメッセージを送信する。
wall [file] ※Ubuntu 14.04	同上
	
コマンド	説明
ldconfig /bin/bash	共有ライブラリのキャッシュファイル「/etc/ld.so.cache」を更新するコマンド
lsmod /bin/bash	ロードされているモジュールを確認するためのコマンド
modprobe /bin/bash	モジュールをロード・アンロードするためのコマンド
cat /bin/bash	ファイルの内容を表示するコマンド
	
/etc/apt/sources.List	パッケージ取得元を設定する。
	
Apt-get [オプション] サブコマンド	説明
install パッケージ名	パッケージのインストール又はアップグレード
remove パッケージ名	パッケージのアンインストール
upgrade	インストール済みの全パッケージのアップグレード
dist-upgrade	ディストリビューションを最新版にアップグレード
update	パッケージのデータベースを最新版に更新
clean	過去に取得したパッケージファイルを削除
	
	
	
	
	
	

